package ru.mephi.java.chapter01.lab01.ex12;

// В состав комплекта разработки Java Development Kit входит архивный файл src. zip с исходным кодом библиотеки Java.
// Разархивируйте этот файл и с помощью избранного вами инструментального средства для поиска текста найдите в этом
// исходном коде примеры применения последовательностей операторов break и continue с меткой. Выберите один из этих
// примеров и перепишите его без оператора с меткой.

public class Class12 {
    public static void main(String[] args) {

    }
}
